{"intents": [
    {"tag": "greeting",
    "patterns": ["hello","hey","hi","good day","greetings","what's up?","how is it going?","how do you do?","how are you?","hi,nice to meet you"],
    "responses": ["Hello!,how are you?","Hello!,what can I do for you?","Hey!,what can I do for you?","Hi!,what can I do for you?","Hello,nice to meet you!","Hi,nice to meet you!"]
    },
    {"tag": "goodbye",
    "patterns": ["cya","see you later","goodbye","I am leaving","have a good day","bye","cao","see ya"],
    "responses": ["Goodbye!","Talk to you later","Bye,see you later","Goodbye,always happy to help!","Bye,you know where to find me","Goodbye,take care!"]
    },
    {"tag": "name",
    "patterns": ["what is your name?","what should i call you?","what's your name?","who are you?","can you tell me your name?","what are you?"],
    "responses": ["My name is Career Assistant","I am your Career Assistant!", "You can call me Career Assistant","I am Career Assistant,your helper in achieving your careeer!"]
    },
    {"tag": "duty",
    "patterns": ["what are you here for?","what will you do for me?","what all can you do for me?","what are your duties?","what are you?","what will you do?"],
    "responses": ["I am your Career Assistant. You can ask me anything related to your career achievement! I can help you with choosing your perfect career, training for it, knowing about all your opportunities and solve all your queries about different professions!"]
    },
    {"tag": "about app",
    "patterns": ["How can i use this app?","What are the settings of this app?","How am I supposed to use this app?","how do i use this app?","what is this app?"],
    "responses": ["The Career Assistant will help you to know everything about professions and your career! For accessing the functions and others related to this app, you can refer to the 'settings' function in this!"]
    },
    {"tag": "profession choosing",
    "patterns": ["How can I choose my profession?","What is my best profession?","What is my profession?","What is the best profession for me?","Which profession do I select?","How do I select a profession?","How can I select a profession?","Select me a profession"],    
    "responses": ["The basis of the journey of achieving a successful career is understanding your talents and interests precisely and selecting a profession which will suit the best for you. This procedure can be done by some simple Career aptitude tests. Here are some sources for you to take your test!: https://www.careerizma.com/apps/career-aptitude-test/, https://www.123test.com/career-test/. Do note one thing, you don't have to bother about taking this test if you have your profession already decided by yourself and is 100% sure about that, unless you wish to be precise of course!"]
    },
    {"tag": "The test",
    "patterns": ["I don't think I got the perfect profession for me","I am not sure the profession I got in the test suits me","I don't like the profession I got","What if the profession I got selected doesn't suit me?","What if the test was not correct?","What if I got the wrong profession?","I want to chnage my profession","I have another profession I like, I don't like the one the test selected me","I like another profession, can I choose it as my career?","Is the aptitude test very precise?","Can't I change the profession I got from the aptitude test?","I like another profession?"],
    "responses": ["The profession you got from the aptitude test is based on the answers you've given to the questions. However, we can't be sure it is 100% sure. But it does calculate a profession which will be suitable for you. Well, if you feel like the profession is not perfect for you or you don't like the profession you've currently got you can simply just redo the test, this time being completely honest about everything! If you like another profession than the one you've gotten, it's also okay! If you have the confidence and the will to work hardly to achieve your dream job, it's great! You can surely achieve that!"]
    },
    {"tag": "Teacher",
    "patterns": ["I'd like to become a teacher","Can I become a Teacher?","I want to become a Teacher","I want to be a Teacher, tell me about it","Tell me all about the profession Teacher","what are the benefits of the profession Teaching?","What are the opportunities of Teaching","Is Teaching a good profession?"],
    "responses": ["Teaching is a great option for you if you like to learn as well as teach,help,guide and direct others! A Teacher is a person who helps students to acquire knowledge, competence or virtue. Informally the role of teacher may be taken by anyone. A 'Profession Teacher' is a licensed professionel who possesses dignity and reputation with high moral values as well as technical and professional competence. Several studies show that subject matter knowledge, teaching skills, and personality are the key factors that influence students’ learning patterns. You can become a great mentor and teacher for the students and achieve milestones. Job stability, Improving salary and benefits, Teaching what you love, Working with kids(or teenagers), Different day different wirk, Different years Different class, Managing your classes, Influencing the next generation, Nice and organised scheduling, etc. are some of the many benefits of this amazing yet challenging profession!"]
    },
    {"tag": "Teaching procedure",
    "patterns": ["How do I become a Teacher?","How to become a teacher?","What should I do about becoming a Teacher?","What can I do to become a Teacher?","What is the procedure to become a Teacher?","How can I become a Teacher?","What should I do to become a Teacher?"],
    "responses": ["How to become a Primary School teacher? : After completing class 12th, you can do a Diploma in Education (D.Ed.), which is a 2 years diploma course. After completing class 12th, you can do a Primary Teacher Training (PTT) program which is of 2-years duration. You can do a Bachelor of Elementary Education (B.El.Ed.), which is a 4-year integrated degree program. It is offered for training teachers at the primary/elementary school level. Many States in India conduct the Teacher Eligibility Test (TET) to recruit Primary School Teachers in Government and Government aided primary schools. How to become a Secondary and Higher Secondary School Teacher? : After completing graduation in any subject, you can do a Bachelor in Education (B.Ed.) degree, which is a 2-year teacher training program. A B.Ed. a degree is a basic requirement to pursue a career in teaching in a secondary and higher secondary school. You can do a Master’s degree after graduation and then do a B.Ed. to teach students in higher secondary classes or those who are in class 11 and 12. To qualify for central government-run schools and some private schools, you will need to qualify in the Central Teacher Eligibility Test (CTET). The Central Board of Secondary Education (CBSE) conducts the Central Teacher Eligibility Test (CTET) for candidates to be eligible to teach at the secondary and higher secondary levels. Moreover, some states conduct a separate Teacher Eligibility Test (TET) or a State Level Eligibility Test (SLET) or a similar test conducted by the school service commission for recruiting secondary level and higher secondary level teachers at Government-run schools as well as Government aided schools. How to become a College or University Teacher? : To become eligible for a career in teaching in a college or university, you must have at least a Master’s level degree. However, a Ph.D. degree is mandatory for promotion from the position of a Lecturer to that of an Associate Professor. After completing a Master’s degree, you will need to apply for and qualify in the National Eligibility Test (NET) conducted by the National Testing Agency (NTA). A postgraduate degree and a certification of eligibility in the NET are two mandatory requirements for becoming a university teacher or lecturer. This is the highest position and the most sought career pathway for those looking for a career in teaching. Some states conduct a State Eligibility Test (SET) for the recruitment of Lecturers in the various colleges run by the Governments."]
    },
    {"tag": "Primary Teacher",
    "patterns": ["How do I become a primary Teacher?","What can I do to become a primary teacher","How to become a primary Teacher?","What are the procedures to become a Secondary Teacher?"],
    "responses": ["After completing class 12th, you can do a Diploma in Education (D.Ed.), which is a 2 years diploma course. After completing class 12th, you can do a Primary Teacher Training (PTT) program which is of 2-years duration. You can do a Bachelor of Elementary Education (B.El.Ed.), which is a 4-year integrated degree program. It is offered for training teachers at the primary/elementary school level. Many States in India conduct the Teacher Eligibility Test (TET) to recruit Primary School Teachers in Government and Government aided primary schools."]
    },
    {"tag": "Secondary/Higher Secondary Teacher",
    "patterns": ["How can I become a Secondary teacher?","What should I do to become a Secondary Teacher?","What are the procedures to become a Secondary Teacher?", "How can I become a Higher Secondary teacher?","What should I do to become a Higher Secondary Teacher?","What are the procedures to become a Higher Secondary Teacher?"],
    "responses": ["After completing graduation in any subject, you can do a Bachelor in Education (B.Ed.) degree, which is a 2-year teacher training program. A B.Ed. a degree is a basic requirement to pursue a career in teaching in a secondary and higher secondary school. You can do a Master’s degree after graduation and then do a B.Ed. to teach students in higher secondary classes or those who are in class 11 and 12. To qualify for central government-run schools and some private schools, you will need to qualify in the Central Teacher Eligibility Test (CTET). The Central Board of Secondary Education (CBSE) conducts the Central Teacher Eligibility Test (CTET) for candidates to be eligible to teach at the secondary and higher secondary levels. Moreover, some states conduct a separate Teacher Eligibility Test (TET) or a State Level Eligibility Test (SLET) or a similar test conducted by the school service commission for recruiting secondary level and higher secondary level teachers at Government-run schools as well as Government aided schools."]
    },
    {"tag": "College/University Teacher",
    "patterns": ["How can I become a College teacher?","What should I do to become a College Teacher?","What are the procedures to become a Collage Teacher?", "How can I become a University teacher?","What should I do to become a University Teacher?","What are the procedures to become a University Teacher?"],
    "responses": ["To become eligible for a career in teaching in a college or university, you must have at least a Master’s level degree. However, a Ph.D. degree is mandatory for promotion from the position of a Lecturer to that of an Associate Professor. After completing a Master’s degree, you will need to apply for and qualify in the National Eligibility Test (NET) conducted by the National Testing Agency (NTA). A postgraduate degree and a certification of eligibility in the NET are two mandatory requirements for becoming a university teacher or lecturer. This is the highest position and the most sought career pathway for those looking for a career in teaching. Some states conduct a State Eligibility Test (SET) for the recruitment of Lecturers in the various colleges run by the Governments."]
    },
    {"tag": "Responsibilities of Teacher",
    "patterns": ["What are the responsibilities of a teacher?","What should I do if I become a Teacher?","What are my duties as a Teacher?"],
    "responses": ["The responsibilities of a teacher are far-reaching and can significantly vary depending on the school in which you teach, your specialist subject and the surrounding community. The duties of a teacher can include : Teaching students based on national curriculum guidelines within your specialist subject areas. Planning, preparing and delivering lessons. Encouraging student participation in lessons and in other school-related activities. Supporting the leadership team to implement the school’s development plan. Assessing and reporting on the behaviour of students. Providing educational and social guidance to students and/or signposting them to specialist areas of advice when needed. Ensuring the highest standards of quality and applying the most up-to-date teaching methods. Taking part in opportunities to boost your own learning and continuous professional development (CPD). Attending and taking part in staff meetings to support the smooth running and administration of the school. Collaborating with parents, carers, guardians, support workers, and other professionals to safeguard and ensure the educational welfare of statemented students who may have special educational needs (SEN). etc."]
    },
    {"tag": "feedback",
    "patterns": ["can i give feedback for this app?","where could i give feedback for this app?","i like this app","this app is good"],
    "responses": ["Your feedback is very valuable for us,so kindly rate our app and record your comment"]
    }
]}